{
  "name": "Abdulahad Tahir",
  "email": "abdulahadtahir433@gmail.com",
  "phone": "0092-304-4688919",
  "education": "& Certi cations\nIBM / Enterprise Design Thinking Practitioner 2020\nMERN Stack / Aptech Lahore 2020\nBSCS / NCBA&E Lahore 2022",
  "experience": "s\nAscend - Saudi HealthCare solutions providers\nSoftware Engineer – Full Time / Saudia - Pakistan\n08/2021 - Present\nWorked more with JavaScript technologies such as React, Node.js, Next.js, Gatsby.js,\nExpress.js, Vue.js, and React Native, as well as databases like MongoDB and SQL.\nDeveloped and implemented a project management tool that resulted in a 75% increase in\nsatisfaction levels, higher conversions, and better ROI.\nDesigned and developed user-centric interfaces for several projects, utilizing expertise in UX,\ninteraction design, and user testing.\nManaged multiple projects simultaneously as a team lead, ensuring effective communication,\ncollaboration, and delivery of quality work.\nIntegrated multiple systems and services, including payment gateways, CRMs, and email\nmarketing platforms, using APIs for dashboards and KPIs.\nOptimized website and application performance with techniques such as lazy loading, code\nsplitting, and caching, dynamic, reusable components to ensure codebase efficiency and\nconsistency, resulting in faster load times and improved user experience.\nPage 2 of 2\nCompleted Android and iOS application development, utilizing the latest technologies and\nindustry-standard practices.\nImplemented code quality standards, conducted code reviews, and developed project\ndocumentation.\nFacilitated team meetings, mentored junior developers, and utilized agile methodologies to\nmanage projects effectively.\nWon the award for the best application developer in 2022, demonstrating proficiency in code\npractices, optimization, and development.\nOneDiv - Global IT services & solutions\nAss. Software Engineer / Canada - Pakistan\nWorked with various technologies including Redux, Google Maps API, push notifications,\nanimations, chart and graph integrations, language localization, WordPress, and\nWooCommerce.\nCreated and managed inventory systems, management software, and classifieds data\nvisualization platform for clients.\nDeveloped reusable React components, ensuring consistency and efficiency in project\ndevelopment.\nBuilt and managed ecommerce stores, utilizing platforms such as WooCommerce and\nWordPress to create user-friendly and efficient online stores.\nDeveloped user interfaces and integrated APIs as a Front-End Developer for various projects.\nWorked with backend technologies as well such as Node.js, Express.js and Laravel.\nOther Relevant Work Experience\nElbiz Official / Full Stack Dev 2021\nVideo White Pvt. Ltd / Front-End Dev 2021\nSmart Analytics / Full Stack Dev 2020\nElbiz Official / Full Stack Dev 2021\nVideo White Pvt. Ltd / Front-End Dev 2021\nSmart Analytics / Full Stack Dev 2020",
  "skills": "Technologies & Frameworks /\nFRONTEND / React.js, Next.js, React Native, HTML, SCSS, CSS, Bootstrap\nBACKEND / PHP, Laravel, WordPress, Express.js, Nest.js, SQL, MongoDB\nKey Skills / UI/UX design and implementation, integrating & creating APIs, cPanel management,\nmobile apps development, converting Figma designs to apps, graphs and visualizations, Cross-\nbrowser compatibility, accessibility, Web performance optimization, version control, Agile Scrum\nmethodology, project management, collaboration,and teamwork",
  "languages": "/ English, Urdu, Hindi"
}
