{"name":"Ongoing\nC","email":"abdullahmansoor277@gmail.com","phone":"+92 334 3182713","profiles":"github.com/abdullahmansoor727","summary":"I am a motivated front-end developer with around two years of\nexperience creating custom websites using HTML, CSS,\nJavaScript, Bootstrap, ReactJS, and VueJS. I am a quick\nlearner and always eager to step out of my comfort zone to\nlearn new skills and technologies. Furthermore, I am currently\nworking on my backend skill to become a full-stack developer.","experience":"Frontend Developer\nTechsol360\nKarachi, Pakistan\n(Full-Time, On-Site)\nDeveloped user interfaces with modern JavaScript frameworks\n(VueJS), HTML5 and CSS3.\nTroubleshot and debugged code ensuring compatibility with devices,\nbrowsers, and operating systems.\nWorked on a Software as a Service (SaaS) LMS application based on\na multi-tenant structure.\nManaged code modularity in order to minimize modifications when\ndelivering to multiple tenants.\nReactJS Developer\nParhako \" The Future of E-learning\nKeil, Germany\n(Part-Time, Remote)\nWorked on a public forum application, Parhako.com. Developed the\nFrontend React Application using the (then) latest version of React.\nRevised, modularized and updated old code bases to modern\ndevelopment standards, reducing operating costs and improving\nfunctionality.\nRefactored the application to replacing class components with\nfunctional components and used React Hooks in place of the native\nlife cycle methods.\nImplemented API calls using React Apollo and GraphQL to streamline\nuser interface performance.\nCollaborated with the Project Manager to provide enhanced solutions\nthrough iterative design generations.\nWorked in the Agile model for software development, attending daily\nScrums and collaborating with the backend team to ensure smooth\nand timely completing of milestones.","education":"BS Computer Science\nSalim Habib University\nBS Computer Science\nHabib University\nO' & A' Levels\nWHALES College","skills":"STRENGTHS\nAttention To Detail\nI have an eye for tiny details that make or\nbreak the overall user experience.\nArt of Simplicity\nI try to find the simplest solution to\ncomplex problems.","approxExperienceInYears":"0.0"}