{"name":"Software Developer","experience":"2022 – ONGOING (KARACHI, PAKISTAN \" FULL TIME)\nSoftware Developer / ByteCorp Technologies\nDeveloped user interfaces with modern JavaScript frameworks (ReactJS).\nTroubleshot and debugged code ensuring compatibility with devices, browsers, and operating systems.\nWorked on the company's AI driven solution, Autilent. Developed the frontend interface for the dashboard.\nManaged code modularity in order to minimize repetition and multiple modifications.\n2021 – 2022 (KARACHI, PAKISTAN \" FULL TIME)\nFrontend Developer / Techsol360\nDeveloped user interfaces with modern JavaScript frameworks (VueJS), HTML5 and CSS3.\nTroubleshot and debugged code ensuring compatibility with devices, browsers, and operating systems.\nWorked on a Software as a Service (SaaS) LMS application based on a multi-tenant structure.\nManaged code modularity in order to minimize modifications when delivering to multiple tenants.\n2019 – 2021 (KEIL, GERMANY\" PART TIME)\nReactJS Developer / Parhako \" The Future of E-learning\nWorked on a public forum application, Parhako.com. Developed the Frontend React Application using the (then) latest\nversion of React.\nRevised, modularized and updated old code bases to modern development standards, reducing operating costs and\nimproving functionality.\nRefactored the application to replacing class components with functional components and used React Hooks in place of the\nnative life cycle methods.\nImplemented API calls using React Apollo and GraphQL to streamline user interface performance.\nCollaborated with the Project Manager to provide enhanced solutions through iterative design generations.\nWorked in the Agile model for software development, attending daily Scrums and collaborating with the backend team to\nensure smooth and timely completing of milestones.","skills":"VueJS + Vuex \" ReactJS \" jQuery \" JavaScript \" NodeJS \" HTML/CSS \" .NET Core \" Flutter\n2","projects":"OCTOBER 2022 – FEBRUARY 2023\nTruckistan (Frontend Development) / ByteCorp\nTECHNOLOGIES: REACT JS (TYPESCRIPT)\nWorked on the frontend development of Truckistan's Admin and Customer Portal built on ReactJS(Typescript),\nStrapi Backend with PostgreSQL.\nDeveloped the front end using Atomic Design Pattern and implemented Redux Toolkit and RTKQuery for\ncommunication with the backend.\nCollaborated with the development team with Truckistan Technologies to understand the requirements\nfollowing the Agile Development Model.\nSEPTEMBER 2022 – ONGOING\nShaed (Frontend Development) / ByteCorp\nTECHNOLOGIES: REACT JS (JAVASCRIPT)\nWorked on the Frontend Development of Shaed built on ReactJS, NodeJS, MongoDB. I worked on website\nfrontend on ReactJS.\nFixed bugs and resolved validation issues.\nSEPTEMBER 2022 – OCTOBER 2022\nAutilent (Frontend Development) / ByteCorp\nTECHNOLOGIES: REACT JS (TYPESCRIPT)\nWorked on the Frontend Development of the company's product 'Autilent' built on ReactJS, Flask, PostgreSQL,\nwith Nano hardware.\nAutilent is an AI driven solution built for driver road safety and to reduce the chance of accidents for commercial\ntransport vehicles.\nI worked on the Fleet Manager & Super Admin Dashboard which manages drivers, vehicles, devices and users.\nAUGUST 2021 – AUGUST 2022\nLean360LMS (Frontend Development) / TechSol360\nTECHNOLOGIES: VUE JS\nHandled the complete frontend development of the company's product \"Learn360LMS\" built on VueJS, .NET\nCore & MS SQL Server.\nLearn360LMS is a Content Management system developed by TechSol360, inspired by Udemy. It is the most\npopular LMS system used by most major institutes teaching ACCA in Pakistan.\nI developed the frontend from scratch of the 4th iteration of their LMS software using VueJS, implementing a\ncomponent-based approach to ensure modularity and avoid repetition of code."}