{"name":"T M","email":"m.fahadzafar88@gmail.com","phone":"92) 3123071150","experience":"Muhammad Fahad\nDate of birth: 02/07/1989\nNationality: Pakistani\nGender: Male\nMuhammad Fahad\nDate of birth: 02/07/1989\nNationality: Pakistani\nGender: Male","contacts":"House # C-54, Kohsar Phase-\nII, Latifabad, Sindh, Pakistan\n71000 Hyderabad, Pakistan\n(Home)\nm.fahadzafar88@gmail.com\n(+92) 3123071150\nhttps://bit.ly/3F2UBDz\n+923123071150 (Whatsapp)\n16/06/2021 – CURRENT Hyderabad, Pakistan\nGeneral Responsibilities- Mortgages\nExplore new leads and perform relationship management to\nachieve business goals\nPrepare for credit applications and provide necessary follow-up\nactions to deliver premium service to clients\nBe responsive to client's enquires and advise clients solutions to\nresolve any issues or complaints\nCollaborate with internal parties including credit, risk control and\ncompliance team to achieve business goals and fulfil regulatory\nand internal policies requirements\nPerform analysis, provide insights and make necessary\nrecommendation to management\nSupport ad-hoc work tasks and projects as assigned by supervisors","additional":"Responsibilities- Merchant Acquiring\nBe responsible for managing profitable merchant acquiring\nbusiness of the bank and attract profitable new merchants to the\nbank in line with the bank's strategy.\nLiaise with the Area Managers / Branch Managers / Relationship\nMangers of Corporate / SME business lines within the bank to\ndevelop profitable merchant acquiring business'\nStrengthen merchant relationships in order to secure profitable\nmerchant business.\nMonitor daily performance and update the trends to the\nmanagement.\nCoordinate with the outsourced merchant acquiring sales team in\norder to provide a proper support and conduct new installations\n29/01/2018 – 15/06/2021 Hyderabad , Pakistan\nPartner with customers through their life-cycle and offer suitable\nproducts and services based on their financial needs\nNurture the current customer relationships while maintaining the\nquality of the portfolios\nExpand and develop the customer base by onboarding new\ncustomers\nAnalyze consumer needs, current market trends, and potential\npartnerships to offer unique and technology-driven solutions\nBuild a short/medium/long-term sales pipeline per market\nopportunities\nFormulate sales strategies, tap into cross-selling and upsell\nopportunities, to ensure maximum customer reach.\nOffer 360-degree banking to the individual, professional and\nbusiness ecosystem\nA customer seeks insights and advice and hence superior\nknowledge and service are distinguishing factors of success\nRelationship Manager- Mortgages Habib Bank Limited\nRelationship Manager- Retail Liabilities Habib Bank\nLimited\n1 / 3\nINFORMATION\nManagement and leadership skills\nHobbies and interests\nKarachi, Pakistan\nAddress Institute of Business Administration, City Campus , Karachi, Pakistan\nKarachi, Pakistan\nAddress Building # 9-A, PECHS Block-C, Beside Hotel Faran, 2nd Floor, Shahrah-e-Faisal, Karachi, Pakistan\nKarachi, Pakistan\nAddress Building # 9-A, PECHS Block-C, Beside Hotel Faran, 2nd Floor, Shahrah-e-Faisal, Karachi, Pakistan\nKarachi, Pakistan\nAddress Building # 9-A, PECHS Block-C, Beside Hotel Faran, 2nd Floor, Shahrah-e-Faisal, , Karachi, Pakistan\nKarachi, Pakistan\nAddress Building # 9-A, PECHS Block-C, Beside Hotel Faran, 2nd Floor, Shahrah-e-Faisal, , Karachi, Pakistan\nKarachi, Pakistan\nAddress NIBAF SBP BSC Shahrah e Noor Jahan، Block A North Nazimabad Town,, Karachi, Pakistan\nDiploma in Capital Market Institute of Business Administration\nFundamentals of Capital Market Regulations Certification Institute of Financial\nMarket Pakistan\nPakistan's Market Regulation Certification Institute of Financial Market Pakistan\nStock Brokers' Certification Institute of Financial Market Pakistan\nCommodity Brokers' Certification Institute of Financial Market Pakistan\nFundamentals of Islamic Banking & Operation National Institute of Banking &\nFinance, State Bank of Pakistan.\nBusiness Development\nCustomer Service Management\nPortfolio Management\nKey Accounts Management\nListening Music\nHangout with friends\nCurrent Affairs & Politics\nGym\n3 / 3","education":"AND TRAINING\n02/11/2015 – 26/01/2018 Hyderabad, Pakistan\nExpending relationship by generation, deposits mobilization and cross selling to existing customers,\nResponsible for facilitating in delivery of seamless services to customers.\nAttain cross sell and branch liability targets.\nAnswer queries regarding account balances, transaction, products and services.\nAssist in opening bank accounts and sell available banking products to new and existing customers.\nProvide financial consultancy to the customers for right product according to their financial needs\nand investments.\nInsure the quality service our customers and fulfill their needs.\n15/05/2015 – 30/10/2015 Hyderabad, Pakistan\nEvaluate and standardize curriculum and teaching methodologies\nRecruit, hire, dismiss, and train staff\nCommunicate with families\nLead practices for achievement of high academic standards\nMeet with administrative communities, superintendents, and school boards as well as local, state,\nand federal agencies\nMonitor financial affairs, including budgets and purchasing of school expenses\nConduct teacher and staff evaluations to ensure proper implementation of curriculum\nRepresent and maintain school image and reputation\nAdjudicate appropriate discipline for delinquent students\nCommunicate with parents regarding failing grades or disciplinary issues\nSupervise care of the facility for safety and quality of physical condition\nAttend school-related events on weekends and evenings\nPrepare for the upcoming school year during the summer\nRelationship Manager- Retail Liabilities United Bank Limited\nAdministrator Green House Five Star High School\n01/01/2016 – 31/12/2017 Jamshoro, Pakistan\nAddress Jamshoro, Pakistan\n01/01/2010 – 31/12/2012 Jamshoro, Pakistan\nAddress Jamshoro, Pakistan\n01/01/2007 – 31/12/2008 Jamshoro, Pakistan\nAddress Jamshoro, Pakistan\n01/08/2004 – 31/05/2006 Hyderabad, Pakistan\nAddress Hyderabad Institute of Arts, Science & Technology, Auto Bhan Road, Latifabad, Hyderabad, Hyderabad,\nPakistan\n01/03/2003 – 31/03/2004 Hyderabad, Pakistan\nAddress Somi Grammar High School, Unit # 2, Latifabad, Hyderabad, Sindh., Hyderabad, Pakistan\nMasters of Arts- Economics University of Sindh\nMasters of Business Administration- Finance University of Sindh\nBachelor of Commerce University of Sindh\nIntermediate- Pre Engineering Hiast\nMatriculation- Science Somi Grammar High School\n2 / 3\nLANGUAGE SKILLS\nMOTHER TONGUE(S): Urdu\nOther language(s):\nEnglish\nListening\nC2\nReading\nC2\nSpoken production\nC1\nSpoken\ninteraction\nC1\nWriting\nC1","skills":"MOTHER TONGUE(S): Urdu\nOther language(s):\nEnglish\nListening\nC2\nReading\nC2\nSpoken production\nC1\nSpoken\ninteraction\nC1\nWriting\nC1"}