{"name":"Syed Muhammad","email":"hasanhere11@gmail.com","phone":"+92-334-012-4776","profiles":"https://github.com/hasanhaider1","education":"Habib University Karachi,Pakistan\nBachelors of Science in Computer Science Aug. 2017 – June. 2021\nWHALES College Karachi, Pakisan\nPre-Engineering; Aug. 2015 – May. 2017","experience":"Ambsan Technologies Karachi, Pakistan\nSoftware Engineer July 2022 - Present\nXenon HR Module Dashboards: .Net Core development on powerbuilder to create interactive dashboard for\nHuman Resources module for an ERP system.\nZepcom Karachi, Pakistan\nAssociate Software Engineer Sep 2021 - July 2022\nD-Bargain: D-Bargain is an online bargaining tool created to facilitate the e-commerce platforms in order to\ncreate a real life shopping experience by allowing them to bargain the product prices.\nFTZ Plugin: This plugin was meant to allow real time data migration between Magento and Shopware 6 stores.\nCrystal Comp: Crystal Comp is a website dedicated to parents of babies. From baby items to parenting training\ncourses, Crystal Comp creates a single platform for all parental needs. My role here was to create the backend for a\nplugin that allows the creation and function of online courses resembling the popular E-Learning Platforms such as\nCoursera, Udemy etc\nAboshop Plugin: Aboshop plugin was meant to create an enhanced user experience for the e-commerce stores.\nThis required amendments in multiple core functionalities of Shopware 6.\nZepcom Karachi, Pakistan\nSoftware Engineer Trainee June 2021 - Sep 2021\nFront-End Development: Worked on creating custom themes and making changes on the default theme of\nShopware 6.\nBack-End Development: Created plugin to perform various backend functionalities.\nZepcom Karachi, Pakistan\nSoftware Engineer Intern March 2021 - May 2021\nFull Stack Development: Worked with a client on making modifications on their plugin","projects":"Hisaab Kitaab: A desktop application intended to fulfill all the accounting needs of a firm while ensuring that the data\nwas analyzed and used for multiple purposes such as to create accounting ratios\nOptimizing N-Body Problem: Designed a parallel approach to Barnes-Hut algorithm using the Nvidia platform\nsupport\nGarbage Image Classifier: Developed an AI based application to classify garbage as recyclable and non-recyclable.\nCar Advertisement Scrapper: A web-scrapper designed to show information of vehicles from different websites on a\nsingle page.\nDyslexic Combat System: An online portal to support people suffering from dyslexia. This platform allows people to\nget training through online courses and for the caretakers to get some training as well.\nCollege Scorecard Analysis: Analyzed a data set from Kaggle to figure out which college is suitable for the students\nas per their requirements.\nSDL Game: Made a pac-man game using OOP concepts.\nElection Processing System: Designed a desktop application for elections at Habib University.\nProgramming Skills","certification":"s\nBusiness Analysis and Process Management: Coursera\nAutomize Business Communication using Power Automize: Coursera\nWorking with BigQuery: Coursera\nJira SCRUM project: Coursera\nCreate a Virtual Private Cloud (VPC) using AWS: Coursera\nFundamentals of Accelerated Computing with CUDA Python: NVIDIA\nFundamentals of Accelerated Computing with CUDA C/C++: NVIDIA\nGraphics Designing: The Earning Academy Pakistan\nWebsite Designing: The Earning Academy Pakistan\nWorkshop in Cyber Security Essentials and Secure Code Review: Cretivok\nBusiness Analysis and Process Management: Coursera\nAutomize Business Communication using Power Automize: Coursera\nWorking with BigQuery: Coursera\nJira SCRUM project: Coursera\nCreate a Virtual Private Cloud (VPC) using AWS: Coursera\nFundamentals of Accelerated Computing with CUDA Python: NVIDIA\nFundamentals of Accelerated Computing with CUDA C/C++: NVIDIA\nGraphics Designing: The Earning Academy Pakistan\nWebsite Designing: The Earning Academy Pakistan\nWorkshop in Cyber Security Essentials and Secure Code Review: Cretivok","approxExperienceInYears":"2.1"}