{"name":"Contact\nEducation","email":"yasiryaseen590@gmail.com","phone":"+92-311-8415087","education":"+92-311-8415087\nPhone\nyasiryaseen590@gmail.com\nEmail\n1-j 57/2 Naziamabad no 1, karachi\nAddress\nYasir Yaseen\nM E R N D e v e l o p e r\nI am a self-employed professional developer. I have experience in the development life cycle of\ndynamic Applications, and sound knowledge of numerous programming languages including\nJavaScript (ES6), java, c-sharp, PHP, and python","experience":"The primary role is to manage CRMs and automate the systems. I am also dipping and\ndiving into multiple domains like GTM, google analytics, and writing custom JavaScript to\ntrack funnels. I have built many in-house projects for the company on diverse domains\nand programming languages.\nFull Stack Developer\nFreelancing\nFeb 2022 - Present\nSep 2019-present\nMadsgency, Karachi\nFiverr, Upwork and local clients\nUsman Institute Of Technology\nBachelor of Computer Science\nSep 2016 - Oct 2020\nReact JS\nEnglish\nUrdu\nExpertise\nLanguage\nNode JS\nMongoDB\nExpress JS\nPostGraphQL\nTI worked with diverse clients in the software industry while freelancing. The major\nprojects which I have done for a client are CRMs, CMS, ERP systems, and payment\ngateway integrations. The languages which I used are javascript and PHP with\nframeworks like React JS and Laravel.","technology":"Bachelor of Computer Science\nSep 2016 - Oct 2020\nReact JS\nEnglish\nUrdu\nExpertise\nLanguage\nNode JS\nMongoDB\nExpress JS\nPostGraphQL\nTI worked with diverse clients in the software industry while freelancing. The major\nprojects which I have done for a client are CRMs, CMS, ERP systems, and payment\ngateway integrations. The languages which I used are javascript and PHP with\nframeworks like React JS and Laravel.","projects":"The Application is based on React JS front-end and the backend is on CodeIgniter APIs.\nThe admin can create new clients and users and set a commission for individual media\nbuyers. Each media buyer has their own credentials to see their commission on the basis\nof clients.\nMar 2022 - May 2022\nCommission Application\nThe application is used to remove the object from an image, clone the object and paste it\non any other location on an image. The application is created on the android studio by\nusing JAVA language and OpenCV java library.\nDec 2021 - Jan 2022\nRemove Object from Image\nThe client needs a customized application for his store that manages almost 5000\ncustomers. I created a desktop application on Microsoft Visual Studio by using the C-\nsharp programming language with a SQL database.\nNov 2020 - Apr 2021\nMerchant Customized software\nI worked with a software company and integrate a perfect money and PayPal payment\nsystem in their E-commerce project based on PHP CodeIgniter.\nFeb 2020 - Feb 2020\nPayment System Integration\nCustomized order receiving android application created on react native and MySQL lite\ndatabase. Application is capable of importing products and customer lists that use to take\nan order with their customer reference.\nJun 2021 - Aug 2021\nAndroid application for order receiving\nThe Web application is based on the PHP CodeIgniter framework. Users have all CRUD\nfunctionality in the Invoice system and also manage users' access limitations. And user\ncan print their invoice as well.\nApr 2020 - May 2020\nInvoice System\nThe Web-application is for company client to view their marketing data and feedback on\nit. In this Application, the marketing data is coming from multiple resources like google\nAds API, tracking code and etc. The system technology is the PHP CodeIgniter framework\nI have used to build a complete application with ajax for secure asynchronous request\ndata from the server.\nMar 2022 - Jun 2022\nCRM System\nThis was our FYP project at graduation. We have used a 2d floor plan dataset and train\nmodel on all different objects like walls, tables, chairs, etc. Then separated those regions\nby using masking and replacing those objects with 3D components to create a 3D floor\nplan.\nJun 2019 - Sep 2020\nFloor map 2D to 3D model by using AI"}